maxboss10086/max_dsp/max/F28388D/8_clb_endat_clk/device/driverlib/inc/hw_epwmxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP7MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP7MUXENABLE_MUX0  0x1U         // mux0 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX1  0x2U         // Mux1 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX2  0x4U         // Mux2 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX3  0x8U         // Mux3 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX4  0x10U        // Mux4 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX5  0x20U        // Mux5 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX6  0x40U        // Mux6 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX7  0x80U        // Mux7 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX8  0x100U       // Mux8 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX9  0x200U       // Mux9 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX10  0x400U       // Mux10 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX11  0x800U       // Mux11 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX12  0x1000U      // Mux12 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX13  0x2000U      // Mux13 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX14  0x4000U      // Mux14 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX15  0x8000U      // Mux15 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX16  0x10000U     // Mux16 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX17  0x20000U     // Mux17 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX18  0x40000U     // Mux18 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX19  0x80000U     // Mux19 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX20  0x100000U    // Mux20 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX21  0x200000U    // Mux21 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX22  0x400000U    // Mux22 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX23  0x800000U    // Mux23 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX24  0x1000000U   // Mux24 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX25  0x2000000U   // Mux25 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX26  0x4000000U   // Mux26 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX27  0x8000000U   // Mux27 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX28  0x10000000U  // Mux28 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX29  0x20000000U  // Mux29 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX30  0x40000000U  // Mux30 to drive TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIP7MUXENABLE_MUX31  0x80000000U  // Mux31 to drive TRIP7 of
                                               // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP8MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP8MUXENABLE_MUX0  0x1U         // mux0 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX1  0x2U         // Mux1 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX2  0x4U         // Mux2 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX3  0x8U         // Mux3 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX4  0x10U        // Mux4 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX5  0x20U        // Mux5 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX6  0x40U        // Mux6 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX7  0x80U        // Mux7 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX8  0x100U       // Mux8 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX9  0x200U       // Mux9 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX10  0x400U       // Mux10 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX11  0x800U       // Mux11 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX12  0x1000U      // Mux12 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX13  0x2000U      // Mux13 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX14  0x4000U      // Mux14 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX15  0x8000U      // Mux15 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX16  0x10000U     // Mux16 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX17  0x20000U     // Mux17 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX18  0x40000U     // Mux18 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX19  0x80000U     // Mux19 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX20  0x100000U    // Mux20 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX21  0x200000U    // Mux21 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX22  0x400000U    // Mux22 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX23  0x800000U    // Mux23 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX24  0x1000000U   // Mux24 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX25  0x2000000U   // Mux25 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX26  0x4000000U   // Mux26 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX27  0x8000000U   // Mux27 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX28  0x10000000U  // Mux28 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX29  0x20000000U  // Mux29 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX30  0x40000000U  // Mux30 to drive TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX31  0x80000000U  // Mux31 to drive TRIP8 of
                                               // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP9MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP9MUXENABLE_MUX0  0x1U         // mux0 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX1  0x2U         // Mux1 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX2  0x4U         // Mux2 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX3  0x8U         // Mux3 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX4  0x10U        // Mux4 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX5  0x20U        // Mux5 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX6  0x40U        // Mux6 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX7  0x80U        // Mux7 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX8  0x100U       // Mux8 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX9  0x200U       // Mux9 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX10  0x400U       // Mux10 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX11  0x800U       // Mux11 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX12  0x1000U      // Mux12 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX13  0x2000U      // Mux13 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX14  0x4000U      // Mux14 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX15  0x8000U      // Mux15 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX16  0x10000U     // Mux16 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX17  0x20000U     // Mux17 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX18  0x40000U     // Mux18 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX19  0x80000U     // Mux19 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX20  0x100000U    // Mux20 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX21  0x200000U    // Mux21 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX22  0x400000U    // Mux22 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX23  0x800000U    // Mux23 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX24  0x1000000U   // Mux24 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX25  0x2000000U   // Mux25 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX26  0x4000000U   // Mux26 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX27  0x8000000U   // Mux27 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX28  0x10000000U  // Mux28 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX29  0x20000000U  // Mux29 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX30  0x40000000U  // Mux30 to drive TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX31  0x80000000U  // Mux31 to drive TRIP9 of
                                               // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP10MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP10MUXENABLE_MUX0  0x1U         // mux0 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX1  0x2U         // Mux1 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX2  0x4U         // Mux2 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX3  0x8U         // Mux3 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX4  0x10U        // Mux4 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX5  0x20U        // Mux5 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX6  0x40U        // Mux6 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX7  0x80U        // Mux7 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX8  0x100U       // Mux8 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX9  0x200U       // Mux9 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX10  0x400U       // Mux10 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX11  0x800U       // Mux11 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX12  0x1000U      // Mux12 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX13  0x2000U      // Mux13 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX14  0x4000U      // Mux14 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX15  0x8000U      // Mux15 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX16  0x10000U     // Mux16 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX17  0x20000U     // Mux17 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX18  0x40000U     // Mux18 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX19  0x80000U     // Mux19 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX20  0x100000U    // Mux20 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX21  0x200000U    // Mux21 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX22  0x400000U    // Mux22 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX23  0x800000U    // Mux23 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX24  0x1000000U   // Mux24 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX25  0x2000000U   // Mux25 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX26  0x4000000U   // Mux26 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX27  0x8000000U   // Mux27 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX28  0x10000000U  // Mux28 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX29  0x20000000U  // Mux29 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX30  0x40000000U  // Mux30 to drive TRIP10 of
                                               // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX31  0x80000000U  // Mux31 to drive TRIP10 of
                                               // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP11MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP11MUXENABLE_MUX0  0x1U         // mux0 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX1  0x2U         // Mux1 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX2  0x4U         // Mux2 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX3  0x8U         // Mux3 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX4  0x10U        // Mux4 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX5  0x20U        // Mux5 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX6  0x40U        // Mux6 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX7  0x80U        // Mux7 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX8  0x100U       // Mux8 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX9  0x200U       // Mux9 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX10  0x400U       // Mux10 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX11  0x800U       // Mux11 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX12  0x1000U      // Mux12 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX13  0x2000U      // Mux13 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX14  0x4000U      // Mux14 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX15  0x8000U      // Mux15 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX16  0x10000U     // Mux16 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX17  0x20000U     // Mux17 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX18  0x40000U     // Mux18 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX19  0x80000U     // Mux19 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX20  0x100000U    // Mux20 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX21  0x200000U    // Mux21 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX22  0x400000U    // Mux22 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX23  0x800000U    // Mux23 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX24  0x1000000U   // Mux24 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX25  0x2000000U   // Mux25 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX26  0x4000000U   // Mux26 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX27  0x8000000U   // Mux27 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX28  0x10000000U  // Mux28 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX29  0x20000000U  // Mux29 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX30  0x40000000U  // Mux30 to drive TRIP11 of
                                               // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX31  0x80000000U  // Mux31 to drive TRIP11 of
                                               // EPWM-XBAR

